```
=========> Existing resources:
module.acr.data.azurerm_container_registry_scope_map.pull
module.acr.data.azurerm_container_registry_scope_map.push
module.acr.azurerm_container_registry.this
module.acr.azurerm_container_registry_token.pull
module.acr.azurerm_container_registry_token.push
module.acr.azurerm_container_registry_token_password.pull_password
module.acr.azurerm_container_registry_token_password.push_password
module.acr.azurerm_private_dns_a_record.data
module.acr.azurerm_private_dns_a_record.login_server
module.acr.azurerm_private_dns_zone.pdz
module.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private
module.acr.azurerm_private_endpoint.pep
module.acr.azurerm_subnet.acr
module.acr.azurerm_subnet.container_apps
module.acr.azurerm_virtual_network.vnet
module.container_apps.azurerm_application_insights.this
module.container_apps.azurerm_log_analytics_workspace.this
module.docker_image.docker_image.proxy
module.docker_image.docker_registry_image.proxy
module.docker_image.null_resource.go_code_keeper
module.endpoint_blob.azurerm_storage_account.endpoint
module.endpoint_blob.azurerm_storage_blob.endpoint
module.endpoint_blob.azurerm_storage_container.endpoint
module.resource_group.azurerm_resource_group.this
module.acr.module.public_ip.data.curl.big_data_cloud
module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"]
module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env
module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0]
module.acr.module.public_ip.data.curl.big_data_cloud: Reading...
module.acr.module.public_ip.data.curl.big_data_cloud: Read complete after 1s [id=1734491351]
module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry]
module.container_apps.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.OperationalInsights/workspaces/law-avm-telemetry]
module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0]: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.OperationalInsights/workspaces/telemetry-proxy-log-analytics-workspace]
module.acr.azurerm_private_dns_zone.pdz: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io]
module.acr.azurerm_container_registry.this: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry]
module.acr.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/virtualNetworks/telemetry]
module.endpoint_blob.azurerm_storage_account.endpoint: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Storage/storageAccounts/avmtftelemetrysvc]
module.acr.azurerm_subnet.acr: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/virtualNetworks/telemetry/subnets/acr]
module.acr.azurerm_subnet.container_apps: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/virtualNetworks/telemetry/subnets/containerapps]
module.container_apps.azurerm_application_insights.this: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Insights/components/ai-avm-telemetry]
module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.App/managedEnvironments/telemetry-proxy]
module.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/virtualNetworkLinks/mydnslink]
module.acr.data.azurerm_container_registry_scope_map.push: Reading...
module.acr.data.azurerm_container_registry_scope_map.pull: Reading...
module.acr.azurerm_private_endpoint.pep: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateEndpoints/mype]
module.acr.data.azurerm_container_registry_scope_map.pull: Read complete after 1s [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/scopeMaps/_repositories_pull]
module.acr.azurerm_container_registry_token.pull: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/tokens/pull-token]
module.acr.data.azurerm_container_registry_scope_map.push: Read complete after 1s [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/scopeMaps/_repositories_push]
module.acr.azurerm_container_registry_token.push: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/tokens/push-token]
module.acr.azurerm_container_registry_token_password.pull_password: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/tokens/pull-token/passwords/password]
module.acr.azurerm_container_registry_token_password.push_password: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/tokens/push-token/passwords/password]
module.acr.azurerm_private_dns_a_record.login_server: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/A/avmtelemetry]
module.acr.azurerm_private_dns_a_record.data: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/A/avmtelemetry.eastus.data]
module.docker_image.null_resource.go_code_keeper: Refreshing state... [id=2163648465018959154]
module.docker_image.docker_image.proxy: Refreshing state... [id=sha256:373700c832211c748b83aa556fa67070dd26cff663cbf520972be1d2956ac6eeavmtelemetry.azurecr.io/telemetry_proxy]
module.docker_image.docker_registry_image.proxy: Refreshing state... [id=sha256:35f902827e8c8fb65d5b9eda3c5f26c8bd48f07c8cb0e77ee78701df2f5687e1]
module.endpoint_blob.azurerm_storage_container.endpoint: Refreshing state... [id=https://avmtftelemetrysvc.blob.core.windows.net/blob]
module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"]: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.App/containerApps/telemetry-proxy]
module.endpoint_blob.azurerm_storage_blob.endpoint: Refreshing state... [id=https://avmtftelemetrysvc.blob.core.windows.net/blob/endpoint]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.docker_image.docker_image.proxy has been deleted
  - resource "docker_image" "proxy" {
        id          = "sha256:373700c832211c748b83aa556fa67070dd26cff663cbf520972be1d2956ac6eeavmtelemetry.azurecr.io/telemetry_proxy"
      - name        = "avmtelemetry.azurecr.io/telemetry_proxy" -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.docker_image.docker_image.proxy will be created
  + resource "docker_image" "proxy" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "avmtelemetry.azurecr.io/telemetry_proxy"
      + repo_digest = (known after apply)
      + triggers    = {
          + "code_hash"  = "d50ae297497a1714fc0afadcd02d32fa"
          + "dockerfile" = "55bd302135967045970190be50f8eeb0"
        }

      + build {
          + cache_from     = []
          + context        = "docker_image"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + remove         = true
          + security_opt   = []
          + tag            = [
              + "avmtelemetry.azurecr.io/telemetry_proxy:latest",
            ]
            # (11 unchanged attributes hidden)
        }
    }

  # module.docker_image.docker_registry_image.proxy will be replaced due to changes in replace_triggered_by
-/+ resource "docker_registry_image" "proxy" {
      ~ id                   = "sha256:35f902827e8c8fb65d5b9eda3c5f26c8bd48f07c8cb0e77ee78701df2f5687e1" -> (known after apply)
        name                 = "avmtelemetry.azurecr.io/telemetry_proxy"
      ~ sha256_digest        = "sha256:35f902827e8c8fb65d5b9eda3c5f26c8bd48f07c8cb0e77ee78701df2f5687e1" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.docker_image.null_resource.go_code_keeper must be replaced
-/+ resource "null_resource" "go_code_keeper" {
      ~ id       = "2163648465018959154" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "go_mod"     = "745cc0129d48e96fbf38c30b45b34dc9" -> "57aad6fb0b52eb171ee38d6cf945c087"
          ~ "go_sum"     = "15b0c634b9778c35343cc94bcb1ed3fa" -> "f6485822767034e9224e7b5e7374fc8b"
            # (2 unchanged elements hidden)
        }
    }

  # module.endpoint_blob.azurerm_storage_account.endpoint will be updated in-place
  ~ resource "azurerm_storage_account" "endpoint" {
        id                                 = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Storage/storageAccounts/avmtftelemetrysvc"
        name                               = "avmtftelemetrysvc"
        tags                               = {}
        # (97 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/providers/Microsoft.Security/datascanners/storageDataScanner" -> null
              - endpoint_tenant_id   = "fc2bf966-a984-438c-93b7-bc5a06fe7f0d" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.acr.azurerm_subnet.acr,
  on acr/main.tf line 72, in resource "azurerm_subnet" "acr":
  72:   private_endpoint_network_policies_enabled     = false

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```